spec/vcr_cassettes/valid_stripe_customer.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=katherine%40schmitt.biz&source=tok_visa
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.0.3
      Authorization:
      - Bearer sk_test_KKStXYXKeAGtRAD00YqxBAow
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.0.3","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 4.9.17-c9 (root@30db80bfe262) (gcc version 4.9.2 (Debian 4.9.2-10)
        ) #1 SMP Thu Mar 23 01:38:54 UTC 2017","hostname":"dmyers3-meal-plan-5144623"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 02 Aug 2017 13:10:06 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1396'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_c1tAqGI4V6dgxB
      Stripe-Version:
      - '2017-06-05'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_B8dt7ud8HiNO65",
          "object": "customer",
          "account_balance": 0,
          "created": 1501679406,
          "currency": null,
          "default_source": "card_1AmMbyBFmrdX5M5iefYuQ3L1",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "katherine@schmitt.biz",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1AmMbyBFmrdX5M5iefYuQ3L1",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_B8dt7ud8HiNO65",
                "cvc_check": null,
                "dynamic_last4": null,
                "exp_month": 8,
                "exp_year": 2019,
                "fingerprint": "CH3mOez3zK7e7PYp",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_B8dt7ud8HiNO65/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_B8dt7ud8HiNO65/subscriptions"
          }
        }
    http_version: 
  recorded_at: Wed, 02 Aug 2017 13:10:06 GMT
recorded_with: VCR 3.0.3
